Tekla.Structures.Catalogs.LibraryProfileItem
The LibraryProfileItem class contains information from library profiles in
the catalog. Library profile items can be enumerated using a profile item enumerator.
It is possible to select a library profile item by its name:
using Tekla.Structures.Catalogs;
public class Example
{
public void Example1()
{
LibraryProfileItem LibraryProfileItem = new LibraryProfileItem();
LibraryProfileItem.ProfileName = "HEA300";
LibraryProfileItem.Select();
//Equivalent code:
LibraryProfileItem LibraryProfileItem1 = new LibraryProfileItem();
LibraryProfileItem1.Select("HEA300");
}
}

Tekla.Structures.Catalogs.LibraryProfileItem.aProfileItemAnalysisParameters
An array list with the profile item analysis parameters.

Tekla.Structures.Catalogs.LibraryProfileItem.aProfileItemUserParameters
An array list with the profile item user parameters.

Tekla.Structures.Catalogs.LibraryProfileItem.#ctor
Creates a new library profile item instance.

Tekla.Structures.Catalogs.LibraryProfileItem.ProfileName
The profile item name.

Tekla.Structures.Catalogs.LibraryProfileItem.Select(System.String)
Selects the profile item in the profile database using the given name.
profileName: The name of the profile to select.
Returns: True on success.

Tekla.Structures.Catalogs.LibraryProfileItem.Delete
Deletes the profile item in the profile database.
Returns: True on success.

Tekla.Structures.Catalogs.LibraryProfileItem.Modify
Modifies the profile item in the profile database.
Returns: True on success.

Tekla.Structures.Catalogs.LibraryProfileItem.Copy(System.String)
Copy the library profile item in the profile database to item with new name.
using System;
using Tekla.Structures.Catalogs;
public class Example
{
public void Example1()
{
LibraryProfileItem item = new LibraryProfileItem();
if (item.Select("HEA100"))
{
string newName = "HEA100C";
if (item.Copy(newName))
{
LibraryProfileItem copy = new LibraryProfileItem();
if (copy.Select(newName))
{
Console.WriteLine("HEA100 copied successfully to HEA100C");
}
}
}
}
}
newName: The new name of the copied profile item.
Returns: True on success.